[
  {
    "name": "Webpack",
    "description": "A powerful bundler that compiles modules and assets into a single optimized bundle."
  },
  {
    "name": "TypeScript",
    "description": "A typed superset of JavaScript that adds static type checking to your code."
  },
  {
    "name": "Sass (SCSS)",
    "description": "A CSS preprocessor that adds features like variables, mixins, nesting, and partials."
  },
  {
    "name": "Babel",
    "description": "A JavaScript compiler that lets you write modern JS and transpile it for older browsers."
  },
  {
    "name": "ESLint",
    "description": "A tool to analyze your code for potential errors and enforce coding style rules."
  },
  {
    "name": "Prettier",
    "description": "An opinionated code formatter that ensures consistent code layout."
  },
  {
    "name": "Husky",
    "description": "A tool for managing Git hooks — used here to run checks before commits."
  },
  {
    "name": "Jest",
    "description": "A testing framework for JavaScript with a focus on simplicity and code coverage."
  },
  {
    "name": "npm",
    "description": "The Node package manager used to manage dependencies and run scripts."
  },
  {
    "name": "webpack-dev-server",
    "description": "A development server that provides live reloading and fast feedback."
  },
  {
    "name": "MiniCssExtractPlugin",
    "description": "A plugin that extracts CSS into separate files for production builds."
  },
  {
    "name": "style-loader",
    "description": "Injects CSS into the DOM via style tags — used in development."
  },
  {
    "name": "css-loader",
    "description": "Allows importing CSS files and resolves `@import` and `url()` paths."
  },
  {
    "name": "sass-loader",
    "description": "Loads `.scss` files and compiles them to CSS using Dart Sass."
  },
  {
    "name": "ts-loader",
    "description": "A Webpack loader for compiling TypeScript files."
  },
  {
    "name": "babel-loader",
    "description": "Lets Webpack pass JS through Babel for transpilation."
  }
]
